FV2410/E_0100.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
MaBiS

7.11.1: AD: Übermittlung von normierten Profilen und Profilscharen vom NB an LF bzw. ÜNB



end title
:<b>E_0100</b>;
note right
<b><i>Prüfende Rolle: LF
end note

if (<b>1: </b> Gehört das empfangene Profil bzw. die Profilschar zu einer zuvor abonnierten Profilgruppe aus der Liste der Profildefinitionen?) then (ja)
else (nein)
    :A01;
    note left
        Profil bzw. Profilschar gehört nicht zu einer zuvor abonnierten Profilgruppe
    endnote
    kill;
endif
if (<b>2: </b> Wurde eine Profilschar empfangen?) then (ja)
    if (<b>4: </b> Ist die übermittelte Version der Profilschar für den übermittelten Beginnzeitpunkt höher als die bisher höchste verarbeitete Version der Profilschar zu diesem Zeitpunkt?) then (ja)
    else (nein)
        :A03;
        note left
            Version der Profilschar nicht zugelassen
        endnote
        kill;
    endif
    if (<b>5: </b> Stimmt die angegebene Maßeinheit der verwendeten OBIS-Kennzahl mit der Maßeinheit des Normierungsfaktors aus der Liste der Profildefinitionen überein?) then (ja)
    else (nein)
        :A04;
        note left
            Maßeinheit weicht von Liste der Profildefinitionen ab
        endnote
        kill;
    endif
    if (<b>6: </b> Entspricht die niedrigste Temperaturmaßzahl der Profilschar der Begrenzungskonstante aus der Liste der Profildefinitionen?) then (ja)
    else (nein)
        :A05;
        note left
            Niedrigste Temperaturmaßzahl weicht von Liste der Profildefinitionen ab
        endnote
        kill;
    endif
    if (<b>7: </b> Entspricht die Anzahl der Temperaturmaßzahlen der Profilschar der erwarteten Anzahl der Temperaturmaßzahlen gemäß der Bezugstemperatur und der Begrenzungskonstante aus der Liste der Profildefinition?) then (ja)
    else (nein)
        :A06;
        note left
            Anzahl der Temperaturmaßzahlen weicht von Liste der Profildefinitionen ab
        endnote
        kill;
    endif
else (nein)
    if (<b>3: </b> Ist die übermittelte Version des Profils für den übermittelten Zeitraum höher als die bisher höchste verarbeitete Version des Profils des gleichen Zeitraums?) then (ja)
    else (nein)
        :A02;
        note left
            Version des Profils nicht zugelassen
        endnote
        kill;
    endif
endif
end

@enduml
